In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

**#top 3 rows of dataset**

In [ ]:

df1.head(3)

**#last 3 rows**

In [4]:

df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

**#shape of dataset**

In [5]:

df1.shape

(7, 3)

In [9]:
print('numberes of rows',df1.shape[0])
print('numberes of colss',df1.shape[1])

numberes of rows 7
numberes of colss 3

**# get information about total noumber of woes columns datadtyes and memory requirement**

In [10]:

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

**#To check null values in dataset**
**#this is calculates column wise**

In [18]:

df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

**#calculates null values row wise**

In [19]:

df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

**#get overall statistics about the dataframe**

**#Describe method work in numerical column if u seprcify [include='all'] it will works**

In [23]:

df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [26]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

**#find unique values grom gender column**

In [27]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

**#find the number of unique values from gender columns**

In [28]:
df1['Gender'].nunique()

2

**#display count of unique values in gender column**

In [33]:
df1['Gender'].value_counts

<bound method IndexOpsMixin.value_counts of 0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object>

In [34]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

**#find number of students having marks between 90 to 100 inclusive**

In [41]:
df1['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [38]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [40]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [42]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

**#using between**

In [44]:
sum(df1['Marks'].between(90,100))

4

**#find average marks**

In [46]:
df1['Marks'].mean()

92.14285714285714

**#Apply method**

In [50]:
 def marks(x):
     return x//2

In [51]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [52]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [53]:
df1['fl_half']=df1['Marks'].apply(lambda x:x/2)

In [54]:
df1

      Name  Marks  Gender  Half_marks  fl_half
0  Priyang     98    Male          49     49.0
1   Aadhya     89  Female          44     44.5
2   Krisha     99  Female          49     49.5
3   Vedant     87    Male          43     43.5
4   Parshv     90    Male          45     45.0
5   Mittal     83  Female          41     41.5
6  Archana     99  Female          49     49.5

In [56]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

**#map function male 1female 2**

In [75]:
df1['male_female']=df1['Gender'].map({'Male':1,'Female':0})

In [60]:
df1

      Name  Marks  Gender  Half_marks  fl_half  male_female
0  Priyang     98    Male          49     49.0            1
1   Aadhya     89  Female          44     44.5            0
2   Krisha     99  Female          49     49.5            0
3   Vedant     87    Male          43     43.5            1
4   Parshv     90    Male          45     45.0            1
5   Mittal     83  Female          41     41.5            0
6  Archana     99  Female          49     49.5            0

**#drop columns**

In [66]:
df1.drop('fl_half',axis=1)

      Name  Marks  Gender  Half_marks  male_female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [67]:
df1.drop(['Half_marks','male_female'],axis=1)

      Name  Marks  Gender  fl_half
0  Priyang     98    Male     49.0
1   Aadhya     89  Female     44.5
2   Krisha     99  Female     49.5
3   Vedant     87    Male     43.5
4   Parshv     90    Male     45.0
5   Mittal     83  Female     41.5
6  Archana     99  Female     49.5

In [68]:
df1

      Name  Marks  Gender  Half_marks  fl_half  male_female
0  Priyang     98    Male          49     49.0            1
1   Aadhya     89  Female          44     44.5            0
2   Krisha     99  Female          49     49.5            0
3   Vedant     87    Male          43     43.5            1
4   Parshv     90    Male          45     45.0            1
5   Mittal     83  Female          41     41.5            0
6  Archana     99  Female          49     49.5            0

**#print the name of columns**

In [69]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_marks', 'fl_half', 'male_female'], dtype='object')

In [70]:
df1.index

RangeIndex(start=0, stop=7, step=1)

**#sort the dataframe as per marks column**

In [72]:
df1.sort_values(by='Marks')

      Name  Marks  Gender  Half_marks  fl_half  male_female
5   Mittal     83  Female          41     41.5            0
3   Vedant     87    Male          43     43.5            1
1   Aadhya     89  Female          44     44.5            0
4   Parshv     90    Male          45     45.0            1
0  Priyang     98    Male          49     49.0            1
2   Krisha     99  Female          49     49.5            0
6  Archana     99  Female          49     49.5            0

In [73]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender  Half_marks  fl_half  male_female
2   Krisha     99  Female          49     49.5            0
6  Archana     99  Female          49     49.5            0
0  Priyang     98    Male          49     49.0            1
4   Parshv     90    Male          45     45.0            1
1   Aadhya     89  Female          44     44.5            0
3   Vedant     87    Male          43     43.5            1
5   Mittal     83  Female          41     41.5            0

In [74]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender  Half_marks  fl_half  male_female
2   Krisha     99  Female          49     49.5            0
6  Archana     99  Female          49     49.5            0
0  Priyang     98    Male          49     49.0            1
4   Parshv     90    Male          45     45.0            1
1   Aadhya     89  Female          44     44.5            0
3   Vedant     87    Male          43     43.5            1
5   Mittal     83  Female          41     41.5            0

**#display the name and marks of female studetns**

In [78]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99